; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob13) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate3)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate7)
	(at pallet3 distributor0)
	(clear crate8)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 distributor2)
	(clear pallet6)
	(at pallet7 depot0)
	(clear pallet7)
	(at pallet8 depot0)
	(clear crate6)
	(at pallet9 distributor0)
	(clear crate4)
	(at pallet10 distributor1)
	(clear pallet10)
	(at pallet11 depot2)
	(clear crate2)
	(at truck0 depot0)
	(at truck1 depot0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at crate0 depot2)
	(on crate0 pallet11)
	(at crate1 depot2)
	(on crate1 pallet2)
	(at crate2 depot2)
	(on crate2 crate0)
	(at crate3 depot0)
	(on crate3 pallet0)
	(at crate4 distributor0)
	(on crate4 pallet9)
	(at crate5 distributor0)
	(on crate5 pallet3)
	(at crate6 depot0)
	(on crate6 pallet8)
	(at crate7 depot2)
	(on crate7 crate1)
	(at crate8 distributor0)
	(on crate8 crate5)
)

(:goal (and
		(on crate0 pallet8)
		(on crate1 pallet2)
		(on crate2 crate3)
		(on crate3 pallet7)
		(on crate4 pallet1)
		(on crate5 pallet0)
		(on crate6 crate2)
		(on crate7 crate5)
		(on crate8 pallet4)
	)
))

; plan
1. (drive truck1 depot0 depot2)
   deleted: (at truck1 depot0)
   added: (at truck1 depot2)
   goals met: 1 of 9
2. (lift hoist3 crate8 crate5 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist3) (on crate8 crate5)
   added: (lifting hoist3 crate8) (clear crate5)
   goals met: 1 of 9
3. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 1 of 9
4. (load hoist3 crate8 truck0 distributor0)
   deleted: (lifting hoist3 crate8)
   added: (in crate8 truck0) (available hoist3)
   goals met: 1 of 9
5. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 1 of 9
6. (unload hoist4 crate8 truck0 distributor1)
   deleted: (in crate8 truck0) (available hoist4)
   added: (lifting hoist4 crate8)
   goals met: 1 of 9
7. (drop hoist4 crate8 pallet4 distributor1)
   deleted: (lifting hoist4 crate8) (clear pallet4)
   added: (available hoist4) (at crate8 distributor1) (clear crate8) (on crate8 pallet4)
   goals met: 2 of 9
8. (lift hoist2 crate2 crate0 depot2)
   deleted: (at crate2 depot2) (clear crate2) (available hoist2) (on crate2 crate0)
   added: (lifting hoist2 crate2) (clear crate0)
   goals met: 2 of 9
9. (load hoist2 crate2 truck1 depot2)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck1) (available hoist2)
   goals met: 2 of 9
10. (drive truck1 depot2 depot0)
   deleted: (at truck1 depot2)
   added: (at truck1 depot0)
   goals met: 2 of 9
11. (lift hoist2 crate7 crate1 depot2)
   deleted: (at crate7 depot2) (clear crate7) (available hoist2) (on crate7 crate1)
   added: (lifting hoist2 crate7) (clear crate1)
   goals met: 2 of 9
12. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   goals met: 2 of 9
13. (load hoist2 crate7 truck0 depot2)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck0) (available hoist2)
   goals met: 2 of 9
14. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 2 of 9
15. (lift hoist2 crate0 pallet11 depot2)
   deleted: (at crate0 depot2) (clear crate0) (available hoist2) (on crate0 pallet11)
   added: (lifting hoist2 crate0) (clear pallet11)
   goals met: 2 of 9
16. (unload hoist3 crate7 truck0 distributor0)
   deleted: (in crate7 truck0) (available hoist3)
   added: (lifting hoist3 crate7)
   goals met: 2 of 9
17. (drop hoist3 crate7 crate5 distributor0)
   deleted: (lifting hoist3 crate7) (clear crate5)
   added: (available hoist3) (at crate7 distributor0) (clear crate7) (on crate7 crate5)
   goals met: 3 of 9
18. (lift hoist3 crate4 pallet9 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist3) (on crate4 pallet9)
   added: (lifting hoist3 crate4) (clear pallet9)
   goals met: 3 of 9
19. (load hoist3 crate4 truck0 distributor0)
   deleted: (lifting hoist3 crate4)
   added: (in crate4 truck0) (available hoist3)
   goals met: 3 of 9
20. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 3 of 9
21. (unload hoist1 crate4 truck0 depot1)
   deleted: (in crate4 truck0) (available hoist1)
   added: (lifting hoist1 crate4)
   goals met: 3 of 9
22. (lift hoist3 crate7 crate5 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist3) (on crate7 crate5)
   added: (lifting hoist3 crate7) (clear crate5)
   goals met: 2 of 9
23. (drive truck0 depot1 depot2)
   deleted: (at truck0 depot1)
   added: (at truck0 depot2)
   goals met: 2 of 9
24. (load hoist2 crate0 truck0 depot2)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck0) (available hoist2)
   goals met: 2 of 9
25. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   goals met: 2 of 9
26. (drop hoist3 crate7 crate5 distributor0)
   deleted: (lifting hoist3 crate7) (clear crate5)
   added: (available hoist3) (at crate7 distributor0) (clear crate7) (on crate7 crate5)
   goals met: 3 of 9
27. (unload hoist0 crate2 truck1 depot0)
   deleted: (in crate2 truck1) (available hoist0)
   added: (lifting hoist0 crate2)
   goals met: 3 of 9
28. (drop hoist0 crate2 crate3 depot0)
   deleted: (lifting hoist0 crate2) (clear crate3)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 crate3)
   goals met: 4 of 9
29. (lift hoist0 crate6 pallet8 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 pallet8)
   added: (lifting hoist0 crate6) (clear pallet8)
   goals met: 4 of 9
30. (load hoist0 crate6 truck1 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck1) (available hoist0)
   goals met: 4 of 9
31. (unload hoist0 crate0 truck0 depot0)
   deleted: (in crate0 truck0) (available hoist0)
   added: (lifting hoist0 crate0)
   goals met: 4 of 9
32. (drop hoist0 crate0 pallet8 depot0)
   deleted: (lifting hoist0 crate0) (clear pallet8)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 pallet8)
   goals met: 5 of 9
33. (lift hoist0 crate2 crate3 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 crate3)
   added: (lifting hoist0 crate2) (clear crate3)
   goals met: 4 of 9
34. (load hoist0 crate2 truck0 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck0) (available hoist0)
   goals met: 4 of 9
35. (lift hoist0 crate3 pallet0 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 pallet0)
   added: (lifting hoist0 crate3) (clear pallet0)
   goals met: 4 of 9
36. (drive truck1 depot0 depot2)
   deleted: (at truck1 depot0)
   added: (at truck1 depot2)
   goals met: 4 of 9
37. (unload hoist2 crate6 truck1 depot2)
   deleted: (in crate6 truck1) (available hoist2)
   added: (lifting hoist2 crate6)
   goals met: 4 of 9
38. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 4 of 9
39. (drop hoist1 crate4 pallet1 depot1)
   deleted: (lifting hoist1 crate4) (clear pallet1)
   added: (available hoist1) (at crate4 depot1) (clear crate4) (on crate4 pallet1)
   goals met: 5 of 9
40. (drop hoist0 crate3 pallet7 depot0)
   deleted: (lifting hoist0 crate3) (clear pallet7)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 pallet7)
   goals met: 6 of 9
41. (unload hoist3 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist3)
   added: (lifting hoist3 crate2)
   goals met: 6 of 9
42. (load hoist2 crate6 truck1 depot2)
   deleted: (lifting hoist2 crate6)
   added: (in crate6 truck1) (available hoist2)
   goals met: 6 of 9
43. (drop hoist3 crate2 pallet9 distributor0)
   deleted: (lifting hoist3 crate2) (clear pallet9)
   added: (available hoist3) (at crate2 distributor0) (clear crate2) (on crate2 pallet9)
   goals met: 6 of 9
44. (drive truck1 depot2 distributor0)
   deleted: (at truck1 depot2)
   added: (at truck1 distributor0)
   goals met: 6 of 9
45. (unload hoist3 crate6 truck1 distributor0)
   deleted: (in crate6 truck1) (available hoist3)
   added: (lifting hoist3 crate6)
   goals met: 6 of 9
46. (drop hoist3 crate6 crate2 distributor0)
   deleted: (lifting hoist3 crate6) (clear crate2)
   added: (available hoist3) (at crate6 distributor0) (clear crate6) (on crate6 crate2)
   goals met: 7 of 9
47. (lift hoist3 crate7 crate5 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist3) (on crate7 crate5)
   added: (lifting hoist3 crate7) (clear crate5)
   goals met: 6 of 9
48. (drop hoist3 crate7 crate6 distributor0)
   deleted: (lifting hoist3 crate7) (clear crate6)
   added: (available hoist3) (at crate7 distributor0) (clear crate7) (on crate7 crate6)
   goals met: 6 of 9
49. (lift hoist3 crate5 pallet3 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist3) (on crate5 pallet3)
   added: (lifting hoist3 crate5) (clear pallet3)
   goals met: 6 of 9
50. (load hoist3 crate5 truck1 distributor0)
   deleted: (lifting hoist3 crate5)
   added: (in crate5 truck1) (available hoist3)
   goals met: 6 of 9
51. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 6 of 9
52. (unload hoist0 crate5 truck1 depot0)
   deleted: (in crate5 truck1) (available hoist0)
   added: (lifting hoist0 crate5)
   goals met: 6 of 9
53. (drop hoist0 crate5 pallet0 depot0)
   deleted: (lifting hoist0 crate5) (clear pallet0)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 pallet0)
   goals met: 7 of 9
54. (lift hoist3 crate7 crate6 distributor0)
   deleted: (at crate7 distributor0) (clear crate7) (available hoist3) (on crate7 crate6)
   added: (lifting hoist3 crate7) (clear crate6)
   goals met: 7 of 9
55. (load hoist3 crate7 truck0 distributor0)
   deleted: (lifting hoist3 crate7)
   added: (in crate7 truck0) (available hoist3)
   goals met: 7 of 9
56. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 7 of 9
57. (unload hoist0 crate7 truck0 depot0)
   deleted: (in crate7 truck0) (available hoist0)
   added: (lifting hoist0 crate7)
   goals met: 7 of 9
58. (drop hoist0 crate7 crate5 depot0)
   deleted: (lifting hoist0 crate7) (clear crate5)
   added: (available hoist0) (at crate7 depot0) (clear crate7) (on crate7 crate5)
   goals met: 8 of 9
59. (lift hoist3 crate6 crate2 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist3) (on crate6 crate2)
   added: (lifting hoist3 crate6) (clear crate2)
   goals met: 7 of 9
60. (drop hoist3 crate6 pallet3 distributor0)
   deleted: (lifting hoist3 crate6) (clear pallet3)
   added: (available hoist3) (at crate6 distributor0) (clear crate6) (on crate6 pallet3)
   goals met: 7 of 9
61. (lift hoist3 crate2 pallet9 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist3) (on crate2 pallet9)
   added: (lifting hoist3 crate2) (clear pallet9)
   goals met: 7 of 9
62. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 7 of 9
63. (load hoist3 crate2 truck0 distributor0)
   deleted: (lifting hoist3 crate2)
   added: (in crate2 truck0) (available hoist3)
   goals met: 7 of 9
64. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 7 of 9
65. (unload hoist0 crate2 truck0 depot0)
   deleted: (in crate2 truck0) (available hoist0)
   added: (lifting hoist0 crate2)
   goals met: 7 of 9
66. (drop hoist0 crate2 crate3 depot0)
   deleted: (lifting hoist0 crate2) (clear crate3)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 crate3)
   goals met: 8 of 9
67. (lift hoist3 crate6 pallet3 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist3) (on crate6 pallet3)
   added: (lifting hoist3 crate6) (clear pallet3)
   goals met: 8 of 9
68. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 8 of 9
69. (load hoist3 crate6 truck0 distributor0)
   deleted: (lifting hoist3 crate6)
   added: (in crate6 truck0) (available hoist3)
   goals met: 8 of 9
70. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 8 of 9
71. (unload hoist0 crate6 truck0 depot0)
   deleted: (in crate6 truck0) (available hoist0)
   added: (lifting hoist0 crate6)
   goals met: 8 of 9
72. (drop hoist0 crate6 crate2 depot0)
   deleted: (lifting hoist0 crate6) (clear crate2)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 crate2)
   goals met: 9 of 9
